lab6/przygotowawcze/aplikacja2_2/app/views/students/index.html.erb

  <% end %><br>
<% Student.all.each do |st| %>
---
SELECT "students".* FROM "students"