lab7/aplikacja2_2/app/views/students/index.html.erb

SELECT "students".* FROM "students"
---
  <% end %><br>
<% Student.all.each do |st| %>