lab7/aplikacja2_2/app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."surname" = ? LIMIT ?  [["surname", "Nowak"], ["LIMIT", 1]]
---
    def index
        @mystudent = @@mystudent
        if @mystudent
            puts 'valid #{@mystudent.valid?}'
            puts 'msgs #{@mystudent.errors.messages}'
        end
        query = request.env['QUERY_STRING']
        @can_edit = false
        if query != ''
            surname = query[query.index('=') + 1..query.length - 1]
            @@mystudent = Student.find_by(surname: surname)

SELECT  "students".* FROM "students" WHERE "students"."surname" = ? LIMIT ?  [["surname", "Kowalski"], ["LIMIT", 1]]
UPDATE "students" SET "name" = ?, "can_edit" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "jan"], ["can_edit", 0], ["updated_at", "2019-05-29 09:00:35.918160"], ["id", 4]]
---
    def update
        if @@mystudent
            @@mystudent.errors.clear
        end
        nazwisko = params[:id]
        imie = params[:imie]
        rok = params[:rok]
        edit = params[:edit] == '1'

        @@mystudent = Student.find_by(surname: nazwisko)
        @@mystudent.update(name: imie, can_edit: edit, rok: rok)

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]
INSERT INTO "students" ("name", "surname", "rok", "can_edit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "nowy"], ["surname", "student"], ["rok", 2], ["can_edit", 0], ["created_at", "2019-05-29 07:51:28.862491"], ["updated_at", "2019-05-29 07:51:28.862491"]]
---
    def create
        if @@mystudent
            @@mystudent.errors.clear
        end
        nazwisko = params[:nazwisko]
        imie = params[:imie]
        rok = params[:rok]
        edit = params[:edit] == '1'

        @@mystudent = Student.create(name: imie, surname: nazwisko, can_edit: edit, rok: rok)

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]
SELECT  "students".* FROM "students" WHERE "students"."surname" = ? LIMIT ?  [["surname", "student"], ["LIMIT", 1]]
---
    def destroy
        if @@mystudent
            @@mystudent.errors.clear
        end
        nazwisko = params[:id]
        @@mystudent = Student.find_by(surname: nazwisko)